<template>
  <div class="EventsPageTabs">
    <div class="EventsPageTabs__tabs">
      <div class="EventsPageTabs__tabs-scroll">
        <button
          class="EventsPageTabs__tab"
          :class="{ active: index === indexActiveTab }"
          v-for="(item, index) in listArray"
          @click="setIndex(index)"
        >
          {{ item.title }}
        </button>
      </div>
    </div>
    <div class="EventsPageTabs__content">
      <EventsPageTabItem
        v-for="item in currentTab"
        :title="item.title"
        :description="item.description"
        :date="item.date"
        :time="item.time"
        :key="item.id"
      />
    </div>
  </div>
</template>

<script setup lang="ts">
import { computed, ref } from 'vue';
import './EventsPageTabs.scss';
import EventsPageTabItem from '@/views/EventsPage/EventsPageTabs/EventsPageTabItem/EventsPageTabItem.vue';

interface ItemTab {
  id: number;
  title: string;
  description: string;
  date: string;
  time: string;
}

const indexActiveTab = ref<number>(0);

const setIndex = (index: number) => {
  indexActiveTab.value = index;
};

const currentTab = computed<ItemTab[]>(() => {
  const tab = listArray[indexActiveTab.value];
  return tab ? tab.items : [];
});

const listArray = [
  {
    id: 1,
    title: 'Киберспорт',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
  {
    id: 2,
    title: 'Мода',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
  {
    id: 2,
    title: 'Музыка',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
  {
    id: 2,
    title: 'Искусство',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
  {
    id: 2,
    title: 'Красота',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
  {
    id: 2,
    title: 'Спорт',
    items: [
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
      {
        id: 1,
        title: 'Форум инфраструктурных проектов среди девелоперов России',
        description:
          'Основная цель ФорумаСоздание платформы для обсуждения актуальных вопросов и обмена опытом в реализации инфраструктурных проектов среди крупнейших',
        date: '18.02.2025',
        time: '19:00',
      },
    ],
  },
];
</script>
