<template>
  <div class="AboutPage">
    <p class="AboutPage__description">
      МИССИЯ благотворительного фонда заключается в поддержке и развитии
      культурных инициатив, способствующих повышению уровня культурной
      осведомленности среди населения. Мы стремимся создать доступные условия
      для участия молодежи в культурных событиях и проектах,укрепляя их связь с
      традициями и современным искусством. ЦЕЛИ: Фонд также нацелен на
      реализацию программ социальной политики, направленных на поддержку
      талантливых молодых людей и обеспечение им возможностей для
      самореализации. Вместе мы формируем общество, в котором культура
      становится основой для гармоничного и творческого развития каждого
      человека.
    </p>
    <h2 class="AboutPage__title">Задачи фонда</h2>
    <h2 class="AboutPage__title">Руководство Фонда</h2>
    <h2>
      Поддержите наш Фонд развития инфраструктурных проектов, спорта и
      молодёжных движений
    </h2>
  </div>
</template>

<script setup lang="ts">
import './AboutPage.scss';
</script>
